
## Plan Result (terraform/cloudflare/b0xp.io/grafana)

[CI link](https://github.com/boxp/arch/actions/runs/16297000926)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * time_rotating.token_rotation


<details><summary>Change Result (Click me)</summary>

```hcl

  # time_rotating.token_rotation will be created
  + resource "time_rotating" "token_rotation" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with cloudflare_access_application.grafana_api,
  on access.tf line 7, in resource "cloudflare_access_application" "grafana_api":
   7: resource "cloudflare_access_application" "grafana_api" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 9 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.grafana_api,
  on dns.tf line 6, in resource "cloudflare_record" "grafana_api":
   6:   value   = cloudflare_tunnel.grafana_api_tunnel.cname # Changed from argocd_api_tunnel

`value` is deprecated in favour of `content` and will be removed in the next
major release.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Deprecated Resource

  with cloudflare_access_application.grafana_api,
  on access.tf line 7, in resource "cloudflare_access_application" "grafana_api":
   7: resource "cloudflare_access_application" "grafana_api" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 9 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.grafana_api,
  on dns.tf line 6, in resource "cloudflare_record" "grafana_api":
   6:   value   = cloudflare_tunnel.grafana_api_tunnel.cname # Changed from argocd_api_tunnel

`value` is deprecated in favour of `content` and will be removed in the next
major release.
```



<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":4278,"Program":"tfcmt","SHA1":"a8a49fa4d730d42d330bb4e137543dbce8601e98","Target":"terraform/cloudflare/b0xp.io/grafana","Vars":{},"WorkflowName":"pull_request_target"} -->